mesh_generation/steady_state_case/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           GAMG;
        smoother         DICGaussSeidel;
        tolerance        1e-6;
        relTol           0.05;

    }

    pFinal
    {
        $p;
        relTol          0;
    }

    U
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-06;
        relTol          0.1;
    }

    UFinal
    {
        $U;
        relTol          0;
    }
	

}

SIMPLE
{
  nNonOrthogonalCorrectors 0;
  pRefCell        0;
  pRefValue       0;

	residualControl
	{
	  p	1e-3;
	  U 1e-4;
          
  }
}

	
relaxationFactors
{
  fields
		{
		  p       0.4;
		}

  equations
		{
		  U      0.5;
		}
}


// ************************************************************************* //
